burakenez/gd32h7xx-cmake-vscode/Projects/GD32H759I_EVAL/26_ENET/Raw_tcpudp/Application/Core/Src/gd32h73x_75x_enet_ext.c
            /* if is not the last descriptor */
            if(num < (count - 1U)) {
                /* configure the next descriptor address */
                if(ENET_DMA_TX == direction) {
                    desc->buffer2_next_desc_addr = (uint32_t)(&txdesc_tab0[num + 1U]);
                } else {
                    desc->buffer2_next_desc_addr = (uint32_t)(&rxdesc_tab0[num + 1U]);
                }
            } else {
                /* when it is the last descriptor, the next descriptor address
                equals to first descriptor address in descriptor table */
                desc->buffer2_next_desc_addr = (uint32_t)desc_tab;
            }
        }
    } else {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab1;
            count = ENET_TXBUF_NUM;

            /* select chain mode */
            desc_status = ENET_TDES0_TCHM;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc1 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab1;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive chained mode and set buffer1 size */
            desc_bufsize = ENET_RDES1_RCHM | (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc1 = desc_tab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff1[num][0]);
            } else {
                desc = &rxdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff1[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* if is not the last descriptor */
            if(num < (count - 1U)) {
                /* configure the next descriptor address */
                if(ENET_DMA_TX == direction) {
                    desc->buffer2_next_desc_addr = (uint32_t)(&txdesc_tab1[num + 1U]);
                } else {
                    desc->buffer2_next_desc_addr = (uint32_t)(&rxdesc_tab1[num + 1U]);
                }
            } else {
                /* when it is the last descriptor, the next descriptor address
                equals to first descriptor address in descriptor table */
                desc->buffer2_next_desc_addr = (uint32_t) desc_tab;
            }
        }
    }
}

/*!
    \brief      initialize the DMA Tx/Rx descriptors's parameters in ring mode, API ID: 0x0003
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[out] none
    \retval     none
*/
void enet_descriptors_ring_init(uint32_t enet_periph, enet_dmadirection_enum direction)
{
    uint32_t num = 0U, count = 0U;
    uint32_t desc_status = 0U, desc_bufsize = 0U;
    volatile enet_descriptors_struct *desc;
    volatile enet_descriptors_struct *desc_tab;

    /* configure descriptor skip length */
    ENET_DMA_BCTL(enet_periph) &= ~ENET_DMA_BCTL_DPSL;
    ENET_DMA_BCTL(enet_periph) |= DMA_BCTL_DPSL(0);

    if(ENET0 == enet_periph) {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab0;
            count = ENET_TXBUF_NUM;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc0 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab0;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* set buffer1 size */
            desc_bufsize = ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc0 = desc_tab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff0[num][0]);
            } else {
                desc = &rxdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff0[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* when it is the last descriptor */
            if(num == (count - 1U)) {
                if(ENET_DMA_TX == direction) {
                    /* configure transmit end of ring mode */
                    desc->status |= ENET_TDES0_TERM;
                } else {
                    /* configure receive end of ring mode */
                    desc->control_buffer_size |= ENET_RDES1_RERM;
                }
            }
        }
    } else {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab1;
            count = ENET_TXBUF_NUM;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc1 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab1;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* set buffer1 size */
            desc_bufsize = ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc1 = desc_tab;
        }

