burakenez/gd32h7xx-cmake-vscode/Projects/GD32H759I_EVAL/26_ENET/Raw_tcpudp/Application/Core/Src/gd32h73x_75x_enet_ext.c
            /* update the current RxDMA descriptor pointer to the next descriptor in RxDMA descriptor table */
            /* chained mode */
            if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RCHM)) {
                dma_current_rxdesc1 = (enet_descriptors_struct *)(dma_current_rxdesc1->buffer2_next_desc_addr);
            } else {
                /* ring mode */
                if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RERM)) {
                    /* if is the last descriptor in table, the next descriptor is the table header */
                    dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                } else {
                    /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                    dma_current_rxdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE + (GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                              enet_periph))));
                }
            }
        }
    }

    return status;
}

/*!
    \brief      handle application buffer data to transmit it, API ID: 0x0005
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  buffer: pointer to the frame data to be transmitted,
                note -- if the input is NULL, user should handle the data in application by himself
    \param[in]  length: the length of frame data to be transmitted
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_frame_transmit(uint32_t enet_periph, uint8_t buffer[], uint32_t length)
{
    uint32_t offset = 0U;
    uint32_t dma_tbu_flag, dma_tu_flag;
    ErrStatus status = SUCCESS;

    if(ENET0 == enet_periph) {
        /* the descriptor is busy due to own by the DMA */
        if(((uint32_t)RESET == (dma_current_txdesc0->status & ENET_TDES0_DAV)) &&
                (length <= ENET_MAX_FRAME_SIZE)) {

            /* if buffer pointer is null, indicates that users has handled data in application */
            if(NULL != buffer) {
                /* copy frame data from application buffer to Tx buffer */
                for(offset = 0U; offset < length; offset++) {
                    (*(__IO uint8_t *)(uint32_t)((dma_current_txdesc0->buffer1_addr) + offset)) = buffer[offset];
                }
            }

            /* set the frame length */
            dma_current_txdesc0->control_buffer_size = length;
            /* set the segment of frame, frame is transmitted in one descriptor */
            dma_current_txdesc0->status |= ENET_TDES0_LSG | ENET_TDES0_FSG;
            /* enable the DMA transmission */
            dma_current_txdesc0->status |= ENET_TDES0_DAV;

            /* check Tx buffer unavailable flag status */
            dma_tbu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TBU);
            dma_tu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TU);

            if((RESET != dma_tbu_flag) || (RESET != dma_tu_flag)) {
                /* clear TBU and TU flag */
                ENET_DMA_STAT(enet_periph) = (dma_tbu_flag | dma_tu_flag);
                /* resume DMA transmission by writing to the TPEN register*/
                ENET_DMA_TPEN(enet_periph) = 0U;
            }

            /* update the current TxDMA descriptor pointer to the next descriptor in TxDMA descriptor table*/
            /* chained mode */
            if((uint32_t)RESET != (dma_current_txdesc0->status & ENET_TDES0_TCHM)) {
                dma_current_txdesc0 = (enet_descriptors_struct *)(dma_current_txdesc0->buffer2_next_desc_addr);
            } else {
                /* ring mode */
                if((uint32_t)RESET != (dma_current_txdesc0->status & ENET_TDES0_TERM)) {
                    /* if is the last descriptor in table, the next descriptor is the table header */
                    dma_current_txdesc0 = (enet_descriptors_struct *)(ENET_DMA_TDTADDR(enet_periph));
                } else {
                    /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                    dma_current_txdesc0 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc0 + ETH_DMATXDESC_SIZE + (GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                              enet_periph))));
                }
            }
        } else {
            status = ERROR;
        }
    } else {
        /* the descriptor is busy due to own by the DMA */
        if(((uint32_t)RESET == (dma_current_txdesc1->status & ENET_TDES0_DAV)) &&
                (length <= ENET_MAX_FRAME_SIZE)) {

            /* if buffer pointer is null, indicates that users has handled data in application */
            if(NULL != buffer) {
                /* copy frame data from application buffer to Tx buffer */
                for(offset = 0U; offset < length; offset++) {
                    (*(__IO uint8_t *)(uint32_t)((dma_current_txdesc1->buffer1_addr) + offset)) = buffer[offset];
                }
            }

            /* set the frame length */
            dma_current_txdesc1->control_buffer_size = length;
            /* set the segment of frame, frame is transmitted in one descriptor */
            dma_current_txdesc1->status |= ENET_TDES0_LSG | ENET_TDES0_FSG;
            /* enable the DMA transmission */
            dma_current_txdesc1->status |= ENET_TDES0_DAV;

            /* check Tx buffer unavailable flag status */
            dma_tbu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TBU);
            dma_tu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TU);

            if((RESET != dma_tbu_flag) || (RESET != dma_tu_flag)) {
                /* clear TBU and TU flag */
                ENET_DMA_STAT(enet_periph) = (dma_tbu_flag | dma_tu_flag);
                /* resume DMA transmission by writing to the TPEN register*/
                ENET_DMA_TPEN(enet_periph) = 0U;
            }

            /* update the current TxDMA descriptor pointer to the next descriptor in TxDMA descriptor table*/
            /* chained mode */
            if((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_TCHM)) {
                dma_current_txdesc1 = (enet_descriptors_struct *)(dma_current_txdesc1->buffer2_next_desc_addr);
            } else {
                /* ring mode */
                if((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_TERM)) {
                    /* if is the last descriptor in table, the next descriptor is the table header */
                    dma_current_txdesc1 = (enet_descriptors_struct *)(ENET_DMA_TDTADDR(enet_periph));
                } else {
                    /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                    dma_current_txdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc1 + ETH_DMATXDESC_SIZE + (GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                              enet_periph))));
                }
            }
        } else {
            status = ERROR;
        }
    }

