burakenez/gd32h7xx-cmake-vscode/Projects/GD32H759I_EVAL/26_ENET/Raw_tcpudp/Application/Core/Src/gd32h73x_75x_enet_ext.c
}

/*!
    \brief      when receiving completed, set RS bit in ENET_DMA_STAT register will immediately set, API ID: 0x0010
    \param[in]  desc: the descriptor pointer which users want to configure
    \param[out] none
    \retval     none
*/
void enet_rx_desc_immediate_receive_complete_interrupt(enet_descriptors_struct *desc)
{
    desc->control_buffer_size &= ~ENET_RDES1_DINTC;
}

/*!
    \brief      when receiving completed, set RS bit in ENET_DMA_STAT register will be set after a configurable delay time, API ID: 0x0011
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  desc: the descriptor pointer which users want to configure
    \param[in]  delay_time: delay a time of 256*delay_time HCLK, this value must be between 0 and 0xFF
    \param[out] none
    \retval     none
*/
void enet_rx_desc_delay_receive_complete_interrupt(uint32_t enet_periph, enet_descriptors_struct *desc, uint32_t delay_time)
{
    desc->control_buffer_size |= ENET_RDES1_DINTC;
    ENET_DMA_RSWDC(enet_periph) = DMA_RSWDC_WDCFRS(delay_time);
}

/*!
    \brief      drop current receive frame, API ID: 0x0012
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[out] none
    \retval     none
*/
void enet_rxframe_drop(uint32_t enet_periph)
{

    if(ENET0 == enet_periph) {
        /* enable reception, descriptor is owned by DMA */
        dma_current_rxdesc0->status = ENET_RDES0_DAV;

        /* chained mode */
        if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RCHM)) {
            if(NULL != dma_current_ptp_rxdesc0) {
                dma_current_rxdesc0 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc0->buffer2_next_desc_addr);
                /* if it is the last ptp descriptor */
                if(0U != dma_current_ptp_rxdesc0->status) {
                    /* pointer back to the first ptp descriptor address in the desc_ptptab list address */
                    dma_current_ptp_rxdesc0 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc0->status);
                } else {
                    /* pointer to the next ptp descriptor */
                    dma_current_ptp_rxdesc0++;
                }
            } else {
                dma_current_rxdesc0 = (enet_descriptors_struct *)(dma_current_rxdesc0->buffer2_next_desc_addr);
            }

        } else {
            /* ring mode */
            if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RERM)) {
                /* if is the last descriptor in table, the next descriptor is the table header */
                dma_current_rxdesc0 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                if(NULL != dma_current_ptp_rxdesc0) {
                    dma_current_ptp_rxdesc0 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc0->status);
                }
            } else {
                /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                dma_current_rxdesc0 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc0 + ETH_DMARXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                          enet_periph)));
                if(NULL != dma_current_ptp_rxdesc0) {
                    dma_current_ptp_rxdesc0++;
                }
            }
        }
    } else {
        /* enable reception, descriptor is owned by DMA */
        dma_current_rxdesc1->status = ENET_RDES0_DAV;

        /* chained mode */
        if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RCHM)) {
            if(NULL != dma_current_ptp_rxdesc1) {
                dma_current_rxdesc1 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc1->buffer2_next_desc_addr);
                /* if it is the last ptp descriptor */
                if(0U != dma_current_ptp_rxdesc1->status) {
                    /* pointer back to the first ptp descriptor address in the desc_ptptab list address */
                    dma_current_ptp_rxdesc1 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc1->status);
                } else {
                    /* pointer to the next ptp descriptor */
                    dma_current_ptp_rxdesc1++;
                }
            } else {
                dma_current_rxdesc1 = (enet_descriptors_struct *)(dma_current_rxdesc1->buffer2_next_desc_addr);
            }

        } else {
            /* ring mode */
            if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RERM)) {
                /* if is the last descriptor in table, the next descriptor is the table header */
                dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                if(NULL != dma_current_ptp_rxdesc1) {
                    dma_current_ptp_rxdesc1 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc1->status);
                }
            } else {
                /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                dma_current_rxdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                          enet_periph)));
                if(NULL != dma_current_ptp_rxdesc1) {
                    dma_current_ptp_rxdesc1++;
                }
            }
        }
    }
}

#if SELECT_DESCRIPTORS_ENHANCED_MODE
/*!
    \brief      get the bit of extended status flag in ENET DMA descriptor, API ID: 0x0012
    \param[in]  desc: the descriptor pointer which users want to get the extended status flag
    \param[in]  desc_status: the extended status want to get,
                only one parameter can be selected which is shown as below
      \arg        ENET_RDES4_IPPLDT: IP frame payload type
      \arg        ENET_RDES4_IPHERR: IP frame header error
      \arg        ENET_RDES4_IPPLDERR: IP frame payload error
      \arg        ENET_RDES4_IPCKSB: IP frame checksum bypassed
      \arg        ENET_RDES4_IPF4: IP frame in version 4
      \arg        ENET_RDES4_IPF6: IP frame in version 6
      \arg        ENET_RDES4_PTPMT: PTP message type
      \arg        ENET_RDES4_PTPOEF: PTP on ethernet frame
      \arg        ENET_RDES4_PTPVF: PTP version format
    \param[out] none
    \retval     value of extended status
*/
uint32_t enet_rx_desc_enhanced_status_get(enet_descriptors_struct *desc, uint32_t desc_status)
{
    uint32_t reval = 0xFFFFFFFFU;

    switch(desc_status) {
    case ENET_RDES4_IPPLDT:
        reval = GET_RDES4_IPPLDT(desc->extended_status);
        break;
    case ENET_RDES4_PTPMT:
        reval = GET_RDES4_PTPMT(desc->extended_status);
        break;
    default:
        if((uint32_t)RESET != (desc->extended_status & desc_status)) {
            reval = 1U;
        } else {
            reval = 0U;
        }
    }


    return reval;
}

/*!
    \brief      initialize the DMA Tx/Rx descriptors's parameters in enhanced chain mode with ptp function, API ID: 0x0013
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[out] none
    \retval     none
*/
void enet_ptp_enhanced_descriptors_chain_init(uint32_t enet_periph, enet_dmadirection_enum direction)
{
    uint32_t num = 0U, count = 0U, maxsize = 0U;
    uint32_t desc_status = 0U, desc_bufsize = 0U;
    volatile enet_descriptors_struct *desc;
    volatile enet_descriptors_struct *desc_tab;
    volatile uint8_t *buf;

    if(ENET0 == enet_periph) {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab0;
            buf = &tx_buff0[0][0];
            count = ENET_TXBUF_NUM;
            maxsize = ENET_TXBUF_SIZE;

            /* select chain mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TCHM | ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc0 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab0;
            buf = &rx_buff0[0][0];
            count = ENET_RXBUF_NUM;
            maxsize = ENET_RXBUF_SIZE;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive chained mode and set buffer1 size */
            desc_bufsize = ENET_RDES1_RCHM | (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc0 = desc_tab;
        }

        /* configuration each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            desc = desc_tab + num;

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;
            desc->buffer1_addr = (uint32_t)(&buf[num * maxsize]);

