burakenez/gd32h7xx-cmake-vscode/Projects/GD32H759I_EVAL/26_ENET/Raw_tcpudp/Application/Core/Src/gd32h73x_75x_enet_ext.c
        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            desc = desc_tab + num;

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;
            desc->buffer1_addr = (uint32_t)(&buf[num * maxsize]);

            /* when it is the last descriptor */
            if(num == (count - 1U)) {
                if(ENET_DMA_TX == direction) {
                    /* configure transmit end of ring mode */
                    desc->status |= ENET_TDES0_TERM;
                } else {
                    /* configure receive end of ring mode */
                    desc->control_buffer_size |= ENET_RDES1_RERM;
                }
            }
        }
    }
}

/*!
    \brief      receive a packet data with timestamp values to application buffer, when the DMA is in enhanced mode, API ID: 0x0015
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  bufsize: the size of buffer which is the parameter in function
    \param[out] buffer: pointer to the application buffer
                note -- if the input is NULL, user should copy data in application by himself
    \param[out] timestamp: pointer to the table which stores the timestamp high and low
                note -- if the input is NULL, timestamp is ignored
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_ptpframe_receive_enhanced_mode(uint32_t enet_periph, uint8_t buffer[], uint32_t bufsize, uint32_t timestamp[])
{
    uint32_t offset = 0U, size = 0U;
    uint32_t timeout = 0U;
    uint32_t rdes0_tsv_flag;
    ErrStatus status = ERROR;

    if(ENET0 == enet_periph) {
        /* the descriptor is busy due to own by the DMA */
        if((uint32_t)RESET == (dma_current_rxdesc0->status & ENET_RDES0_DAV)) {
            /* if no error occurs, and the frame uses only one descriptor */
            if(((uint32_t)RESET == (dma_current_rxdesc0->status & ENET_RDES0_ERRS)) &&
                    ((uint32_t)RESET != (dma_current_rxdesc0->status & ENET_RDES0_LDES)) &&
                    ((uint32_t)RESET != (dma_current_rxdesc0->status & ENET_RDES0_FDES))) {

                /* get the frame length except CRC */
                size = GET_RDES0_FRML(dma_current_rxdesc0->status) - 4U;

                /* if is a type frame, and CRC is not included in forwarding frame */
                if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (dma_current_rxdesc0->status & ENET_RDES0_FRMT))) {
                    size = size + 4U;
                }

                /* copy data from Rx buffer to application buffer if provided and size is valid */
                if((NULL != buffer) && (size <= bufsize)) {
                    for(offset = 0U; offset < size; offset++) {
                        (*(buffer + offset)) = (*(__IO uint8_t *)((dma_current_rxdesc0->buffer1_addr) + offset));
                    }

                    /* get timestamp if the pointer is not NULL */
                    if(NULL != timestamp) {
                        /* wait for ENET_RDES0_TSV flag to be set, the timestamp value is taken and
                        write to the RDES6 and RDES7 */
                        do {
                            rdes0_tsv_flag = (dma_current_rxdesc0->status & ENET_RDES0_TSV);
                            timeout++;
                        } while((RESET == rdes0_tsv_flag) && (timeout < ENET_DELAY_TO));

                        /* proceed only if timeout not reached */
                        if(ENET_DELAY_TO != timeout) {
                            /* clear the ENET_RDES0_TSV flag */
                            dma_current_rxdesc0->status &= ~ENET_RDES0_TSV;
                            /* get the timestamp value of the received frame */
                            timestamp[0] = dma_current_rxdesc0->timestamp_low;
                            timestamp[1] = dma_current_rxdesc0->timestamp_high;

                            status = SUCCESS;
                        }
                    } else {
                        /* if timestamp is not needed, operation is successful */
                        status = SUCCESS;
                    }
                } else if(NULL == buffer) {
                    /* if buffer is NULL, user will handle data in application */
                    /* get timestamp if the pointer is not NULL */
                    if(NULL != timestamp) {
                        /* wait for ENET_RDES0_TSV flag to be set */
                        do {
                            rdes0_tsv_flag = (dma_current_rxdesc0->status & ENET_RDES0_TSV);
                            timeout++;
                        } while((RESET == rdes0_tsv_flag) && (timeout < ENET_DELAY_TO));

                        /* proceed only if timeout not reached */
                        if(ENET_DELAY_TO != timeout) {
                            /* clear the ENET_RDES0_TSV flag */
                            dma_current_rxdesc0->status &= ~ENET_RDES0_TSV;
                            /* get the timestamp value of the received frame */
                            timestamp[0] = dma_current_rxdesc0->timestamp_low;
                            timestamp[1] = dma_current_rxdesc0->timestamp_high;
                        }
                    }
                    status = SUCCESS;
                }
            }

            /* regardless of success or failure, we need to restore DMA reception */
            /* enable reception, descriptor is owned by DMA */
            dma_current_rxdesc0->status = ENET_RDES0_DAV;

            /* check Rx buffer unavailable flag status */
            if((uint32_t)RESET != (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_RBU)) {
                /* Clear RBU flag */
                ENET_DMA_STAT(enet_periph) = ENET_DMA_STAT_RBU;
                /* resume DMA reception by writing to the RPEN register*/
                ENET_DMA_RPEN(enet_periph) = 0U;
            }

