burakenez/gd32h7xx-cmake-vscode/Projects/GD32H759I_EVAL/26_ENET/Raw_tcpudp/Application/Core/Src/gd32h73x_75x_enet_ext.c
        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff0[num][0]);
            } else {
                desc = &rxdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff0[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* when it is the last descriptor */
            if(num == (count - 1U)) {
                if(ENET_DMA_TX == direction) {
                    /* configure transmit end of ring mode */
                    desc->status |= ENET_TDES0_TERM;
                } else {
                    /* configure receive end of ring mode */
                    desc->control_buffer_size |= ENET_RDES1_RERM;
                }
            }
            /* set desc_ptptab equal to desc_tab */
            (&desc_ptptab[num])->buffer1_addr = desc->buffer1_addr;
            (&desc_ptptab[num])->buffer2_next_desc_addr = desc->buffer2_next_desc_addr;
        }
        /* when it is the last ptp descriptor, preserve the first descriptor
        address of desc_ptptab in ptp descriptor status */
        (&desc_ptptab[num - 1U])->status = (uint32_t)desc_ptptab;
    } else {
        /* configure descriptor skip length */
        ENET_DMA_BCTL(enet_periph) &= ~ENET_DMA_BCTL_DPSL;
        ENET_DMA_BCTL(enet_periph) |= DMA_BCTL_DPSL(0);

        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab1;
            count = ENET_TXBUF_NUM;

            /* select ring mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc1 = desc_tab;
            dma_current_ptp_txdesc1 = desc_ptptab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab1;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive ring mode and set buffer1 size */
            desc_bufsize = (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc1 = desc_tab;
            dma_current_ptp_rxdesc1 = desc_ptptab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff1[num][0]);
            } else {
                desc = &rxdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff1[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* when it is the last descriptor */
            if(num == (count - 1U)) {
                if(ENET_DMA_TX == direction) {
                    /* configure transmit end of ring mode */
                    desc->status |= ENET_TDES0_TERM;
                } else {
                    /* configure receive end of ring mode */
                    desc->control_buffer_size |= ENET_RDES1_RERM;
                }
            }
            /* set desc_ptptab equal to desc_tab */
            (&desc_ptptab[num])->buffer1_addr = desc->buffer1_addr;
            (&desc_ptptab[num])->buffer2_next_desc_addr = desc->buffer2_next_desc_addr;
        }
        /* when it is the last ptp descriptor, preserve the first descriptor
        address of desc_ptptab in ptp descriptor status */
        (&desc_ptptab[num - 1U])->status = (uint32_t)desc_ptptab;
    }
}

/*!
    \brief      receive a packet data with timestamp values to application buffer, when the DMA is in normal mode, API ID: 0x0019
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  bufsize: the size of buffer which is the parameter in function
    \param[out] timestamp: pointer to the table which stores the timestamp high and low
    \param[out] buffer: pointer to the application buffer
                note -- if the input is NULL, user should copy data in application by himself
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_ptpframe_receive_normal_mode(uint32_t enet_periph, uint8_t buffer[], uint32_t bufsize, uint32_t timestamp[])
{
    uint32_t offset = 0U, size = 0U;
    ErrStatus status = ERROR;

    if(ENET0 == enet_periph) {
        /* the descriptor is busy due to own by the DMA */
        if((uint32_t)RESET == (dma_current_rxdesc0->status & ENET_RDES0_DAV)) {
            /* if buffer pointer is null, indicates that users has copied data in application */
            if(NULL != buffer) {
                /* if no error occurs, and the frame uses only one descriptor */
                if(((uint32_t)RESET == (dma_current_rxdesc0->status & ENET_RDES0_ERRS)) &&
                        ((uint32_t)RESET != (dma_current_rxdesc0->status & ENET_RDES0_LDES)) &&
                        ((uint32_t)RESET != (dma_current_rxdesc0->status & ENET_RDES0_FDES))) {

                    /* get the frame length except CRC */
                    size = GET_RDES0_FRML(dma_current_rxdesc0->status) - 4U;
                    /* if is a type frame, and CRC is not included in forwarding frame */
                    if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (dma_current_rxdesc0->status & ENET_RDES0_FRMT))) {
                        size = size + 4U;
                    }

                    /* to avoid situation that the frame size exceeds the buffer length */
                    if(size <= bufsize) {
                        /* copy data from Rx buffer to application buffer */
                        for(offset = 0U; offset < size; offset++) {
                            buffer[offset] = (*(__IO uint8_t *)(uint32_t)((dma_current_ptp_rxdesc0->buffer1_addr) + offset));
                        }
                        status = SUCCESS;
                    }
                }
            } else {
                status = SUCCESS;
            }

