burakenez/gd32h7xx-cmake-vscode/Projects/GD32H759I_EVAL/26_ENET/Raw_tcpudp/Application/Core/Src/gd32h73x_75x_enet_ext.c
                /* update the current TxDMA descriptor pointer to the next descriptor in TxDMA descriptor table */
                /* chained mode */
                if((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_TCHM)) {
                    dma_current_txdesc1 = (enet_descriptors_struct *)(dma_current_ptp_txdesc1->buffer2_next_desc_addr);
                    /* if it is the last ptp descriptor */
                    if(0U != dma_current_ptp_txdesc1->status) {
                        /* pointer back to the first ptp descriptor address in the desc_ptptab list address */
                        dma_current_ptp_txdesc1 = (enet_descriptors_struct *)(dma_current_ptp_txdesc1->status);
                    } else {
                        /* pointer to the next ptp descriptor */
                        dma_current_ptp_txdesc1++;
                    }
                } else {
                    /* ring mode */
                    if((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_TERM)) {
                        /* if is the last descriptor in table, the next descriptor is the table header */
                        dma_current_txdesc1 = (enet_descriptors_struct *)(ENET_DMA_TDTADDR(enet_periph));
                        /* TDES2 and TDES3 will not be covered by buffer address, so do not need to preserve a new table,
                        use the same table with TxDMA descriptor */
                        dma_current_ptp_txdesc1 = (enet_descriptors_struct *)(dma_current_ptp_txdesc1->status);
                    } else {
                        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                        dma_current_txdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_txdesc1 + ETH_DMATXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                                  enet_periph)));
                        dma_current_ptp_txdesc1++;
                    }
                }
            }
        }
    }

    return status;
}
#endif /* SELECT_DESCRIPTORS_ENHANCED_MODE */

/*!
    \brief      configure and start PTP timestamp counter, API ID: 0x001B
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  updatemethod: method for updating
      \arg        ENET_PTP_FINEMODE: fine correction method
      \arg        ENET_PTP_COARSEMODE: coarse correction method
    \param[in]  init_sec: second value for initializing system time
    \param[in]  init_subsec: subsecond value for initializing system time
    \param[in]  carry_cfg: the value to be added to the accumulator register (in fine method is used)
    \param[in]  accuracy_cfg: the value to be added to the subsecond value of system time
    \param[out] none
    \retval     none
*/
void enet_ptp_start(uint32_t enet_periph, int32_t updatemethod, uint32_t init_sec, uint32_t init_subsec, uint32_t carry_cfg, uint32_t accuracy_cfg)
{
    /* mask the timestamp trigger interrupt */
    enet_interrupt_disable(enet_periph, ENET_MAC_INT_TMSTIM);

    /* enable timestamp */
    enet_ptp_feature_enable(enet_periph, ENET_ALL_RX_TIMESTAMP | ENET_RXTX_TIMESTAMP);

    /* configure system time subsecond increment based on the PTP clock frequency */
    enet_ptp_subsecond_increment_config(enet_periph, accuracy_cfg);

    if(ENET_PTP_FINEMODE == updatemethod) {
        /* fine correction method: configure the timestamp addend, then update */
        enet_ptp_timestamp_addend_config(enet_periph, carry_cfg);
        enet_ptp_timestamp_function_config(enet_periph, ENET_PTP_ADDEND_UPDATE);
        /* wait until update is completed */
        while(SET == enet_ptp_flag_get(enet_periph, (uint32_t)ENET_PTP_ADDEND_UPDATE)) {
        }
    }

    /* choose the fine correction method */
    enet_ptp_timestamp_function_config(enet_periph, (enet_ptp_function_enum)updatemethod);

    /* initialize the system time */
    enet_ptp_timestamp_update_config(enet_periph, ENET_PTP_ADD_TO_TIME, init_sec, init_subsec);
    enet_ptp_timestamp_function_config(enet_periph, ENET_PTP_SYSTIME_INIT);

#if SELECT_DESCRIPTORS_ENHANCED_MODE
    enet_desc_select_enhanced_mode(enet_periph);
#endif /* SELECT_DESCRIPTORS_ENHANCED_MODE */
}

/*!
    \brief      adjust frequency in fine method by configure addend register, API ID: 0x001C
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  carry_cfg: the value to be added to the accumulator register
    \param[out] none
    \retval     none
*/
void enet_ptp_finecorrection_adjfreq(uint32_t enet_periph, int32_t carry_cfg)
{
    /* re-configure the timestamp addend, then update */
    enet_ptp_timestamp_addend_config(enet_periph, (uint32_t)carry_cfg);
    enet_ptp_timestamp_function_config(enet_periph, ENET_PTP_ADDEND_UPDATE);
}

/*!
    \brief      update system time in coarse method, API ID: 0x001D
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  systime_struct: pointer to a enet_ptp_systime_struct structure which contains
                parameters of PTP system time
                members of the structure and the member values are shown as below:
                  second: 0x0 - 0xFFFF FFFF
                  nanosecond: 0x0 - 0x7FFF FFFF * 10^9 / 2^31
                  sign: ENET_PTP_TIME_POSITIVE, ENET_PTP_TIME_NEGATIVE
    \param[out] none
    \retval     none
*/
void enet_ptp_coarsecorrection_systime_update(uint32_t enet_periph, enet_ptp_systime_struct *systime_struct)
{
    uint32_t subsecond_val;
    uint32_t carry_cfg;

    subsecond_val = enet_ptp_nanosecond_2_subsecond(systime_struct->nanosecond);

    /* save the carry_cfg value */
    carry_cfg = ENET_PTP_TSADDEND_TMSA;

    /* update the system time */
    enet_ptp_timestamp_update_config(enet_periph, systime_struct->sign, systime_struct->second, subsecond_val);
    enet_ptp_timestamp_function_config(enet_periph, ENET_PTP_SYSTIME_UPDATE);

    /* wait until the update is completed */
    while(SET == enet_ptp_flag_get(enet_periph, (uint32_t)ENET_PTP_SYSTIME_UPDATE)) {
    }

    /* write back the carry_cfg value, then update */
    enet_ptp_timestamp_addend_config(enet_periph, carry_cfg);
    enet_ptp_timestamp_function_config(enet_periph, ENET_PTP_ADDEND_UPDATE);
}

/*!
    \brief      set system time in fine method, API ID: 0x001E
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  systime_struct: pointer to a enet_ptp_systime_struct structure which contains
                parameters of PTP system time
                members of the structure and the member values are shown as below:
                  second: 0x0 - 0xFFFF FFFF
                  nanosecond: 0x0 - 0x7FFF FFFF * 10^9 / 2^31
                  sign: ENET_PTP_TIME_POSITIVE, ENET_PTP_TIME_NEGATIVE
    \param[out] none
    \retval     none
*/
void enet_ptp_finecorrection_settime(uint32_t enet_periph, enet_ptp_systime_struct *systime_struct)
{
    uint32_t subsecond_val;
    subsecond_val = enet_ptp_nanosecond_2_subsecond(systime_struct->nanosecond);

    /* initialize the system time */
    enet_ptp_timestamp_update_config(enet_periph, systime_struct->sign, systime_struct->second, subsecond_val);
    enet_ptp_timestamp_function_config(enet_periph, ENET_PTP_SYSTIME_INIT);

    /* wait until the system time initialization finished */
    while(SET == enet_ptp_flag_get(enet_periph, (uint32_t)ENET_PTP_SYSTIME_INIT)) {
    }
}

/*!
    \brief      change nanosecond to subsecond
    \param[in]  nanosecond: nanosecond value
    \param[out] none
    \retval     the subsecond value
*/
static uint32_t enet_ptp_nanosecond_2_subsecond(uint32_t nanosecond)
{
    uint64_t val = nanosecond * 0x80000000ULL;
    val /= 1000000000U;
    return (uint32_t)val;
}
